Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.CannotSlantAnalyticalWallError Property
 Cannot slant a wall with an Analytical Model. Please disable the Analytical Model first.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotSlantAnalyticalWallError { get; }
Public Shared ReadOnly Property CannotSlantAnalyticalWallError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotSlantAnalyticalWallError {
	FailureDefinitionId^ get ();
}
static member CannotSlantAnalyticalWallError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace